Repository: marrebuf/fit-cvut
Catalog: BI-PA2/term-project/po/*.po
Languages: cs

source: invalid input
cs: neplatný vstup

source: end of input
cs: konec vstupu

source: integer
cs: celé číslo

source: real number
cs: reálné číslo

source: identifier
cs: indentifikátor

source: string
cs: řetězec

source: Undefined variable:
cs: Nedefinovaná proměnná:

source: Unexpected `%s' at %d:%d
cs: Neočekáváno "%s" na %d:%d

source: Expression parsing error
cs: Chyba při zpracovávání výrazu

source: Mismatched right parenthesis
cs: Nepřiléhající pravá závorka

source: Mismatched left parenthesis
cs: Neuzavřená levá závorka

source: The expression is empty
cs: Výraz je prázdný

source: Commands: input NAME (ROWS, COLS) Enter a matrix from keyboard delete NAME | * Delete the named variable, or everything load NAME FILENAME Load variable from a file save NAME FILENAME Save variable to a file typeof NAME Print out the type of the variable set OPTION Set program options help Show this help exit Exit the program <expression> Compute the expression and display the result on standard output NAME = <expression> Compute the expression and assign the result to a variable Options: sparse | dense Use sparse or dense storage for new matrices verbose | quiet Be verbose when performing computations Operators in <expression>: +, -, *, ^ Their usual meaning Note that ^ is capable of inverting matrices det Compute matrix determinant rank Compute rank of a matrix transpose Produce a transposed matrix eliminate Apply Gaussian elimination
cs: Příkazy: input NAME (ROWS, COLS) Zadat matici z klávesnice delete NAME | * Smazat jmenovanou proměnnou, nebo vše load NAME FILENAME Nahrát proměnnou ze souboru save NAME FILENAME Uložit proměnnou do souboru typeof NAME Vypsat typ proměnné set OPTION Nastavit volby programu help Zobrazit tuto nápovědu exit Ukončit program <expression> Spočítat výraz a zobrazit výsledek na standardním výstupu NAME = <expression> Spočítat výraz a přiřadit výsledek do dané proměnné Volby: sparse | dense Použít řídké nebo husté úložiště pro nové matice verbose | quiet Být při provádění výpočtů výmluvný Operátory ve <výraz>: +, -, *, ^ Jejich obvyklý význam Pozn.: ^ umí invertovat matice det Spočítat determinant matice rank Spočítat hodnost matice transpose Vytvořit transponovanou matici eliminate Aplikovat Gaussovu eliminaci

source: Not enough values
cs: Příliš málo hodnot

source: Too many values
cs: Příliš mnoho hodnot

source: Enter a %dx%d matrix:
cs: Zadejte matici %dx%d:

source: Matrix input aborted
cs: Maticový vstup přerušen

source: Wrong dimensions
cs: Špatné rozměry

source: Loading failed
cs: Nahrávání selhalo

source: Saving failed
cs: Ukládání selhalo

source: Integer
cs: Celé číslo

source: Real number
cs: Reálné číslo

source: Sparse matrix
cs: Řídká matice

source: Dense matrix
cs: Hustá matice

source: Creating sparse matrices
cs: Vytvářím řídké matice

source: Creating dense matrices
cs: Vytvářím husté matice

source: Verbose mode set to on
cs: Od teď jsem výřečný

source: Verbose mode set to off
cs: Od teď nejsem výřečný

source: Unsupported option:
cs: Nepodporovaná volba:

source: Bye!
cs: Nashle!

source: Error:
cs: Chyba:

source: Welcome to %s
cs: Vítejte v programu %s

source: Type `help' to get started
cs: Zadejte `help' pro vysvětlení

source: Invalid matrix data
cs: Chybná maticová data

source: Cannot add matrices of different dimensions
cs: Nelze sčítat matice s různými rozměry

source: Cannot subtract matrices of different dimensions
cs: Nelze odečítat matice s různými rozměry

source: The matrix has wrong number of rows for multiplication
cs: Matice má pro násobení chybný počet řádků

source: Inverse matrix is only defined for rectangular matrices
cs: Inverzní matice je definována pouze pro čtvercové matice

source: Only regular matrices are invertible
cs: Pouze regulární matice jsou invertovatelné

source: Determinant is only defined for rectangular matrices
cs: Determinant je definován pouze pro čtvercové matice

source: Invalid operands to `%s': %s
cs: Chybné operandy pro "%s": %s

source: Invalid operands to `%s'
cs: Chybné operandy pro "%s"

source: Swapping rows %u and %u
cs: Prohazuju řádky %u a %u

source: Subtracting %g times row %u from row %u
cs: Odčítám %g řádku %u od řádku %u

source: Multiplying row %u by %g
cs: Násobím řádek %u krát %g

source: Resulting in:
cs: Což dává ve výsledku:

source: Beginning Gaussian elimination:
cs: Začínám Gaussovu eliminaci:

source: minus
cs: mínus

source: multiplication
cs: násobení

source: exponentiation
cs: mocnění

source: # VERBOSE INVERSION
cs: # POPIS INVERZE

source: unary minus
cs: unární mínus

source: matrix rank
cs: hodnost matice

source: matrix determinant
cs: determinant matice

source: matrix transposition
cs: transpozice matice

source: matrix elimination
cs: eliminace matice

source: # VERBOSE ELIMINATION
cs: # POPIS ELIMINACE
